jmeter/transaction-service-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.2639999999999993,
    "medianResTime" : 1.5,
    "minResTime" : 0.0,
    "maxResTime" : 24.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 24.0,
    "throughput" : 267.379679144385,
    "receivedKBytesPerSec" : 203.14588903743314,
    "sentKBytesPerSec" : 100.78960561497325
  },
  "Query Transactions" : {
    "transaction" : "Query Transactions",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.2639999999999993,
    "medianResTime" : 1.5,
    "minResTime" : 0.0,
    "maxResTime" : 24.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 24.0,
    "throughput" : 267.379679144385,
    "receivedKBytesPerSec" : 203.14588903743314,
    "sentKBytesPerSec" : 100.78960561497325
  }
}